#pragma once
#include <cstddef>
#include <vector>
#include "..\Common\Common.h"
#include "..\Common\types.h"
#include <map>

extern Point trueFrameDisplayPt;

const DWORD MBAA_ReadDataFile = 0x00407c10;
const DWORD MBAA_StringCopyFromIndex = 0x004079d0;
const DWORD MBAA_SetInfoWindowText = 0x004d9ba0;
const DWORD MBAA_CompareSSOString = 0x0042bdc0;
//wrapper for call to ReadDataFile (misleading name? pulled straight from ghidra)
//subtract 4 bytes from actual destination to get dest input
void ReadDataFile(void* dest, const char* name, int nameLength);

void CopyStringFromIndex(void* dest, void* source, int startIndex, int copyLength);

void SetInfoWindowText(const char* text, void* dest);

struct MenuString
{
	int base;
	union {
		char* pLongString;
		char shortString[0x10];
	};
	int length;
	int maxLength;
};

bool CompareSSOString(const char* compareTo, MenuString* str);

template <typename T>
struct MenuList
{
	int base;
	T* listStart;
	T* listEnd;
	T* listMaxEnd;
};

int GetHotkeyPressed();

void CheckNewHotkey(bool bReset, KeyState& oHotkey, LPCTSTR sRegKey);

void GetKeyStateMenuLabel(char* buffer, KeyState oHotkey);

#define CONCATENATE_DETAIL(x, y) x##y
#define CONCATENATE(x, y) CONCATENATE_DETAIL(x, y)
#define LINE_NAME CONCATENATE(LINE, __LINE__)

#define UNUSED(length) BYTE LINE_NAME[length]

#define CHECKOFFSET(s, v, n) static_assert(offsetof(s, v) == n, #s " offset incorrect for " #v ". Expected " #n);
#define CHECKSIZE(s, n) static_assert(sizeof(s) == n, #s " size must be " #n);

#pragma pack(push, 1)

struct Item //scrolling items on right
{
	MenuString label;
	MenuString tag;
	int value;
};

CHECKOFFSET(Item, tag, 0x1c)
CHECKOFFSET(Item, value, 0x38)
CHECKSIZE(Item, 0x3c)

struct Element //listed elements on left
{
	void* vftable;
	int elementType;
	int isHovered;
	int canSelect;
	int timeHovered;
	int timeNotHovered;
	int bottomMargin;
	float textOpacity;
	MenuString label;
	MenuString tag;
	int selectedItem;
	int selectItemLabelXOffset;
	MenuList<Item*> itemList;

	void SetItemLabel(const char* newLabel, int itemIndex);

	void SetCurItemLabel(const char* newLabel);

	//vftable[6]
	int GetItemValue(int itemIndex);
	
	//vftable[9] sets selectedItem

	//vftable[10] gets selectedItem

	//vftable[11]
	int GetItemListSize();
};

CHECKOFFSET(Element, label, 0x20)
CHECKOFFSET(Element, tag, 0x3c)
CHECKOFFSET(Element, itemList, 0x60)
CHECKSIZE(Element, 0x70)

struct MenuWindow;

struct MenuInfo
{
	void* vftable;
	MenuWindow* parentWindow;
	MenuString label;
	MenuString blank;
	int selectedElement;
	int prevSelectedElement;
	MenuList<Element*> elementList;
	MenuList<MenuString> selectableList;
	int finishedDrawing;
	int timeDisplayed;
	int field_0x70;
	int close;
};

CHECKOFFSET(MenuInfo, label, 0x8)
CHECKOFFSET(MenuInfo, elementList, 0x48)
CHECKOFFSET(MenuInfo, selectableList, 0x58)
CHECKSIZE(MenuInfo, 0x78)

struct TagInfoPair
{
	MenuString tag;
	MenuString info;
};

CHECKSIZE(TagInfoPair, 0x38)

struct InfoWindow
{
	int mode;
	int timeOpen;
	MenuString label;
	MenuString elementTag;
	MenuString itemTag;
	void* mainInfo;
	void* subInfo;
	MenuString font;
	int fontSize;
	int field_0x84;
	int fontThickness;
	MenuList<TagInfoPair*> tagInfoPairList;
	MenuString curTagChecked;
	MenuString curInfo;
	int zLayer;
	int yPosition;
	int windowHeight;
	int field_0xe0;
	int field_0xe4;
	float animationProgress;
};

CHECKOFFSET(InfoWindow, font, 0x64)
CHECKOFFSET(InfoWindow, curInfo, 0xb8)
CHECKSIZE(InfoWindow, 0xec)

struct MenuWindow
{
	void* vftable;
	int menuInfoIndex;
	int field_0x8;
	MenuList<MenuInfo*> menuInfoList;
	int didPress;
	MenuString hoveredTag;
	int field_0x3c;
	int bgXOffset;
	int yOffset;
	int someYOffset;
	int elementsXOffset;
	int field_0x50;
	int field_0x54;
	int field_0x58;
	MenuString label;
	int playerInControl;
	int isRootMenu;
	int timeOpened;
	int openSubmenuIndex;
	int timeSubmenuOpened;
	float closeAnimProgress;
	float menuOpacity;
	float progressionRate;
	float degressionRate;
	int isBlurred;
	int field_0xa0;
	int isMenuBackgroundDisplayed;
	int u_layer;
	int paragraphMode;
	int field_0xb0;
	int textXWidth;
	int textYWidth;
	int isMenuLit;
	float dimScreenPercentage;
	MenuWindow* YesNoMenu;
	MenuWindow* BattleSettings;
	MenuWindow* EnemyStatus;
	MenuWindow* TrainingDisplay;
	MenuWindow* DummySettings;
	int u_hideMenu;
	InfoWindow* InformationMenu;
	MenuWindow* ExtendedSettings;
	MenuWindow* HotkeySettings;

	void SetLabel(const char* newLabel);
	void GetHoveredItemTag();
};

CHECKOFFSET(MenuWindow, menuInfoList, 0xc)
CHECKOFFSET(MenuWindow, label, 0x5c)
CHECKOFFSET(MenuWindow, isRootMenu, 0x7c)
CHECKOFFSET(MenuWindow, dimScreenPercentage, 0xc0)
CHECKSIZE(MenuWindow, 0xe8)

#pragma pack(pop, 1)
#undef CHECKOFFSET
#undef CHECKSIZE

// --- Vectors guide ---
//Empty vectors are blank spaces (only need the one defined)
//Vectors with one value are elements with only a label (like the vanilla "default" and "return" elements)
//Vectors with more than one value are elements with selectable options

const std::vector<const char*> vSPACE_ELEMENT = {};

const std::vector<const char*> vDEFAULT_ELEMENT = {
	"DEFAULT"
};

extern int nPAGE;

const std::vector<const char*> vRETURN_ELEMENT = {
	"RETURN"
};

//Page 1
const std::vector<const char*> vREVERSAL_TYPE = {
	"REVERSALS",
	"OFF", "ON", "ON GUARD", "ON HIT", "ON WAKEUP", "ON SHIELD"
};

const std::vector<const char*> vREVERSAL_SLOT_1 = {
	"REVERSAL SLOT 1",
	"X1", "X2", "X3"
};

const std::vector<const char*> vREV_SLOT_1_WEIGHT = {
	"WEIGHT 1",
	"0", "1", "2" ,"3", "4", "5", "6" ,"7", "8", "9", "10"
};

const std::vector<const char*> vREVERSAL_SLOT_2 = {
	"REVERSAL SLOT 2",
